Revit 2027 API
TessellatedShapeBuilder.LogString Property
 String used for logging, if any. Usually the name of the file from which face sets were imported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string LogString { get; set; }
Public Property LogString As String
	Get
	Set
public:
property String^ LogString {
	String^ get ();
	void set (String^ value);
}
member LogString : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace